Tekla Open API Reference for Tekla Structures 2025
PointCloud.BoundingBox Property
 Gets or sets the bounding box.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB BoundingBox { get; }
Public ReadOnly Property BoundingBox As AABB
	Get
Property Value
Type: AABB
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace